In [2]:
#Data creating in python by dictionary
import pandas as pd
data1={'Name':['John','Ali','pam'],'age':[22,23,25],'subject':['Math','Stat','Hist']}
data1=pd.DataFrame(data1)
data1.head()

   Name  age subject
0  John   22    Math
1   Ali   23    Stat
2   pam   25    Hist

In [3]:
#Date Creating in python by list
Name=['John','Ali','pam']
Age=[22,23,25]
Subject=['Math','Stat','Hist']
list_labels=['Name','Age','Subject']
list_cols=[Name,Age,Subject]
data2=list(zip(list_labels,list_cols))
print(data2)
data2=dict(data2)
data2=pd.DataFrame(data2)
print(data2)

[('Name', ['John', 'Ali', 'pam']), ('Age', [22, 23, 25]), ('Subject', ['Math', 'Stat', 'Hist'])]
   Age  Name Subject
0   22  John    Math
1   23   Ali    Stat
2   25   pam    Hist

In [4]:
#Adding columns into data2
data2['Grade']='A'
print(data2)

   Age  Name Subject Grade
0   22  John    Math     A
1   23   Ali    Stat     A
2   25   pam    Hist     A

In [5]:
#Add index
data2.index=['A','B','C']
print(data2)

   Age  Name Subject Grade
A   22  John    Math     A
B   23   Ali    Stat     A
C   25   pam    Hist     A

In [6]:
#Date Creating in python Csv file
file='C:/Users/chink/Google Drive/Computational Statistics/Kaggle/Titanic/train.csv'
data3=pd.read_csv(file)

data4=pd.read_csv(file,header=None) # Reading header is none means no header in dataset 
data3.head(5)
data4.head(5)

,0,1,2,3,4,5,6,7,8,9,10,11
0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,NaN,S
2,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
3,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,NaN,S
4,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,C123,S

In [7]:
data3.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [22]:
#Changing labels
file2='C:/Users/chink/Google Drive/Computational Statistics/Data Science workgroup/Python_work/file1.csv'
data5=pd.read_csv(file2)
data5.head()

   The following stock data was collect on 2016-AUG-25 from an unknown source
0  These kind of comments are not very useful    ...
1  Probably should just throw this line away too ...
2  name Jan Feb Mar Apr May Jun Jul Aug Sep Oct N...
3  # So that line you just read has all the colum...
4  IBM 156.08 160.01 159.81 165.22 172.25 167.15 ...

In [35]:
#Adding delimiter and removing comments
data6=pd.read_csv(file2,delimiter=' ',header=3,comment='#')
data6.head()

,name,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,...,Unnamed: 74,Unnamed: 75,Unnamed: 76,Unnamed: 77,Unnamed: 78,Unnamed: 79,Unnamed: 80,Unnamed: 81,Unnamed: 82,Unnamed: 83
0,IBM,156.08,160.01,159.81,165.22,172.25,167.15,1...,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
import matlib.py